In [1]:
import pandas as pd

# Basic of Pandas

In [38]:
df=pd.read_excel('D:\Python Data\Pandas\price2.xlsx')

In [39]:
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      NaN   18  610000
3  3600      3.0   30  680000
4  4000      5.0    8  725000

In [40]:
rows,col=df.shape

In [41]:
rows

5

In [42]:
col

4

In [43]:
df.head(2)

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000

In [44]:
df.tail(1)

   area  bedroom  age   price
4  4000      5.0    8  725000

In [45]:
df.columns

Index(['area', 'bedroom', 'age', 'price'], dtype='object')

In [46]:
df.area

0    2600
1    3000
2    3200
3    3600
4    4000
Name: area, dtype: int64

In [47]:
df.age #df['key2']

0    20
1    15
2    18
3    30
4     8
Name: age, dtype: int64

In [50]:
df[['area','price','age']]

   area   price  age
0  2600  550000   20
1  3000  565000   15
2  3200  610000   18
3  3600  680000   30
4  4000  725000    8

In [51]:
type(df)

pandas.core.frame.DataFrame

In [52]:
type(df['age'])

pandas.core.series.Series

In [54]:
df.age.max()

30

In [55]:
df.bedroom.min()

3.0

In [56]:
df.age.mean()

18.2

In [57]:
df.age.std()

8.01249024960405

In [58]:
df.describe()

              area   bedroom       age          price
count     5.000000  4.000000   5.00000       5.000000
mean   3280.000000  3.750000  18.20000  626000.000000
std     540.370243  0.957427   8.01249   74949.983322
min    2600.000000  3.000000   8.00000  550000.000000
25%    3000.000000  3.000000  15.00000  565000.000000
50%    3200.000000  3.500000  18.00000  610000.000000
75%    3600.000000  4.250000  20.00000  680000.000000
max    4000.000000  5.000000  30.00000  725000.000000

In [71]:
df

      bedroom  age   price
area
2600      3.0   20  550000
3000      4.0   15  565000
3200      NaN   18  610000
3600      3.0   30  680000
4000      5.0    8  725000

In [72]:
df.index

Int64Index([2600, 3000, 3200, 3600, 4000], dtype='int64', name='area')

In [79]:
df.set_index('area',inplace=True)

In [74]:
df.loc[2600]

bedroom         3.0
age            20.0
price      550000.0
Name: 2600, dtype: float64

In [75]:
df.reset_index('area',inplace=True)

In [76]:
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      NaN   18  610000
3  3600      3.0   30  680000
4  4000      5.0    8  725000

In [77]:
df.set_index('age',inplace=True)

In [78]:
df

     area  bedroom   price
age
20   2600      3.0  550000
15   3000      4.0  565000
18   3200      NaN  610000
30   3600      3.0  680000
8    4000      5.0  725000

#  2. Different ways of creating Data Frame

1. using csv

2. using excel

3. using python dictionary

4. using list of tuples

5. using list of dictionary

In [87]:
import pandas as pd

#df=pd.read_csv(filename,csv, sep=',')
#df=pd.read_tsv(filename,tsv, sep='\')
df1=pd.read_excel("D:\Python Data\Pandas\HR.xlsx",'Sheet1')

In [88]:
df1

   Example  Label
0      228      0
1       67      1
2      138      1
3      209      0
4      156      1
5       46      0
6      197      0
7        6      0
8      173      1

In [91]:
# Using Dictionary

data={"brand":[ "Ford"],
  "model": ["Mustang"],
  "year": [1964]}

In [92]:
df2=pd.DataFrame(data)

In [93]:
df2

  brand    model  year
0  Ford  Mustang  1964

In [94]:
# Using list as tuple
#remeber need to mention column name
lst=[(1,2,3,4,5),(6,7,8,9,10),(11,2,3,5,6)]

In [109]:
l=pd.DataFrame(lst,columns=['a','b','c',"d",'e'])

In [102]:
l

    a  b  c  d   e
0   1  2  3  4   5
1   6  7  8  9  10
2  11  2  3  5   6